#!/bin/bash
# Изначальное значение
result=1

# Выводим свой PID
echo "Обработчик запущен. PID: $$"
echo "[$(date)] Обработчик запущен. PID: $$" >> "$log_file"

# Функция для вывода результата раз в секунду
print_result() {
  while true; do
    echo "Текущее значение: $result"
    sleep 1
  done
}

# Обработчик сигнала USR1 – добавить 2
trap 'result=$((result + 2))' USR1

# Обработчик сигнала USR2 – умножить на 2
trap 'result=$((result * 2))' USR2

# Обработчик SIGTERM – вывод сообщения и завершение
trap 'echo "Получен сигнал SIGTERM. Завершаю работу обработчика."; exit 0' SIGTERM

# Выводим свой PID, чтобы генератор знал, куда посылать сигналы.
echo "PID обработчика: $$"

# Запускаем функцию вывода результата
print_result
